In [1]:
import pandas as pd
import numpy as np

In [4]:
dias = pd.date_range('20180101', periods = 12)

In [5]:
dias

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08',
               '2018-01-09', '2018-01-10', '2018-01-11', '2018-01-12'],
              dtype='datetime64[ns]', freq='D')

In [6]:
pessoas = ['Paulo', 'Carla', 'Pedro']

In [7]:
nomes = []
gastos = []

for i in range(12):
    nomes.append(np.random.choice(pessoas))
    gastos.append(np.round(np.random.rand()*100, 2))

In [10]:
df = pd.DataFrame({'Nome': nomes, 'Dia': dias, 'Gasto': gastos})
df

     Nome        Dia  Gasto
0   Paulo 2018-01-01  60.66
1   Pedro 2018-01-02  83.18
2   Pedro 2018-01-03  95.10
3   Carla 2018-01-04  28.80
4   Paulo 2018-01-05  42.30
5   Carla 2018-01-06  65.16
6   Pedro 2018-01-07  94.55
7   Paulo 2018-01-08  73.55
8   Carla 2018-01-09   5.95
9   Pedro 2018-01-10  18.93
10  Pedro 2018-01-11  10.71
11  Paulo 2018-01-12  84.03

In [13]:
pv = df.pivot(index='Dia',columns = 'Nome', values = 'Gasto')
pv

Nome        Carla  Paulo  Pedro
Dia
2018-01-01    NaN  60.66    NaN
2018-01-02    NaN    NaN  83.18
2018-01-03    NaN    NaN  95.10
2018-01-04  28.80    NaN    NaN
2018-01-05    NaN  42.30    NaN
2018-01-06  65.16    NaN    NaN
2018-01-07    NaN    NaN  94.55
2018-01-08    NaN  73.55    NaN
2018-01-09   5.95    NaN    NaN
2018-01-10    NaN    NaN  18.93
2018-01-11    NaN    NaN  10.71
2018-01-12    NaN  84.03    NaN

In [14]:
type(pv)

pandas.core.frame.DataFrame